
{
  "title":"Syllabus",
  "content":" Course Meeting Times Lectures: 2 sessions / week, 1 hour / session\nPrerequisites 18.701 Algebra I or 18.703 Modern Algebra; and 18.901 Introduction to Topology\nFamiliarity with topological spaces, covering spaces, and the fundamental group will be assumed, as well as comfort with the structure of finitely generated modules over a PID.\nDescription This is a course on the singular homology of topological spaces. Topics include: Singular homology, CW complexes, Homological algebra, Cohomology, and Poincare duality.\nTextbook There are lots of textbooks that treat algebraic topology more or less at the level of this course.\nBredon, Glen E. Topology and Geometry (Graduate Texts in Mathematics). Springer-Verlag Berlin and Heidelberg GmbH \u0026amp; Company, 1993. ISBN: 9783540979265. [Preview with Google Books] (Complete and geometric)\nDavis, James F., and Paul Kirk. Lecture Notes in Algebraic Topology (Graduate Studies in Mathematics, 35). American Mathematical Society, 2001. ISBN: 9780821821602. [Preview with Google Books] (Interesting selection of topics)\nDold, Albrecht. Lectures on Algebraic Topology (Grundlehren Der Mathematischen Wissenschaften Series). Springer-Verlag, 1980. ISBN: 9780387103693. (Wonderful technique)\nHatcher, Allen. Algebraic Topology. Cambridge University Press, 2001. ISBN: 9780521791601. (Chatty)\nMay, J. Peter. A Concise Course in Algebraic Topology (Chicago Lectures in Mathematics Series). University of Chicago Press, 1999. ISBN: 9780226511832. [Preview with Google Books] (Concise)\nMunkres, James R. Elements of Algebraic Topology. Addison Wesley Publishing Company, 1984. ISBN: 9780201045864. (Meticulous)\nShastri, Anant R. Basic Algebraic Topology. Chapman and Hall / CRC, 2013. ISBN: 9781466562431. [Preview with Google Books] (Verbose)\nSpanier, Edwin H. Algebraic Topology. Springer, 2008. ISBN: 9780387944265. [Preview with Google Books] (Encylopedic)\nVick, James W. Homology Theory: An Introduction to Algebraic Topology. Academic Press, 1973. ISBN: 9780127212500. [Preview with Google Books] (Efficient)\nAssignments and Exams There will be 6 problems sets and a 40 minute oral exam during final exam week.\nGrading The course grade will be based on homework assignments (75%) and a 40 minute oral exam (25%) during final exam week.\n"}


